PinguinoIDE/pinguino-ide/pinguino/p32/include/non-free/proc/p32mx795f512l.h
extern volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLMUL:3;
    unsigned :1;
    unsigned UPLLIDIV:3;
    unsigned :4;
    unsigned UPLLEN:1;
    unsigned FPLLODIV:3;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned :2;
    unsigned FSOSCEN:1;
    unsigned :1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :1;
    unsigned FPBDIV:2;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned :2;
    unsigned FWDTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FDEBUG:2;
    unsigned :1;
    unsigned ICESEL:1;
    unsigned :8;
    unsigned PWP:12;
    unsigned BWP:1;
    unsigned :3;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG0bits_t;
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs")));
#elif defined (__LANGUAGE_ASSEMBLY__)
  .extern WDTCON           /* 0xBF800000 */
  .extern WDTCONCLR        /* 0xBF800004 */
  .extern WDTCONSET        /* 0xBF800008 */
  .extern WDTCONINV        /* 0xBF80000C */
  .extern RTCCON           /* 0xBF800200 */
  .extern RTCCONCLR        /* 0xBF800204 */
  .extern RTCCONSET        /* 0xBF800208 */
  .extern RTCCONINV        /* 0xBF80020C */
  .extern RTCALRM          /* 0xBF800210 */
  .extern RTCALRMCLR       /* 0xBF800214 */
  .extern RTCALRMSET       /* 0xBF800218 */
  .extern RTCALRMINV       /* 0xBF80021C */
  .extern RTCTIME          /* 0xBF800220 */
  .extern RTCTIMECLR       /* 0xBF800224 */
  .extern RTCTIMESET       /* 0xBF800228 */
  .extern RTCTIMEINV       /* 0xBF80022C */
  .extern RTCDATE          /* 0xBF800230 */
  .extern RTCDATECLR       /* 0xBF800234 */
  .extern RTCDATESET       /* 0xBF800238 */
  .extern RTCDATEINV       /* 0xBF80023C */
  .extern ALRMTIME         /* 0xBF800240 */
  .extern ALRMTIMECLR      /* 0xBF800244 */
  .extern ALRMTIMESET      /* 0xBF800248 */
  .extern ALRMTIMEINV      /* 0xBF80024C */
  .extern ALRMDATE         /* 0xBF800250 */
  .extern ALRMDATECLR      /* 0xBF800254 */
  .extern ALRMDATESET      /* 0xBF800258 */
  .extern ALRMDATEINV      /* 0xBF80025C */
  .extern T1CON            /* 0xBF800600 */
  .extern T1CONCLR         /* 0xBF800604 */
  .extern T1CONSET         /* 0xBF800608 */
  .extern T1CONINV         /* 0xBF80060C */
  .extern TMR1             /* 0xBF800610 */
  .extern TMR1CLR          /* 0xBF800614 */
  .extern TMR1SET          /* 0xBF800618 */
  .extern TMR1INV          /* 0xBF80061C */
  .extern PR1              /* 0xBF800620 */
  .extern PR1CLR           /* 0xBF800624 */
  .extern PR1SET           /* 0xBF800628 */
  .extern PR1INV           /* 0xBF80062C */
  .extern T2CON            /* 0xBF800800 */
  .extern T2CONCLR         /* 0xBF800804 */
  .extern T2CONSET         /* 0xBF800808 */
  .extern T2CONINV         /* 0xBF80080C */
  .extern TMR2             /* 0xBF800810 */
  .extern TMR23            /* 0xBF800810 */
  .extern TMR2CLR          /* 0xBF800814 */
  .extern TMR2SET          /* 0xBF800818 */
  .extern TMR2INV          /* 0xBF80081C */
  .extern PR2              /* 0xBF800820 */
  .extern PR23             /* 0xBF800820 */
  .extern PR2CLR           /* 0xBF800824 */
  .extern PR2SET           /* 0xBF800828 */
  .extern PR2INV           /* 0xBF80082C */
  .extern T3CON            /* 0xBF800A00 */
  .extern T3CONCLR         /* 0xBF800A04 */
  .extern T3CONSET         /* 0xBF800A08 */
  .extern T3CONINV         /* 0xBF800A0C */
  .extern TMR3             /* 0xBF800A10 */
  .extern TMR3CLR          /* 0xBF800A14 */
  .extern TMR3SET          /* 0xBF800A18 */
  .extern TMR3INV          /* 0xBF800A1C */
  .extern PR3              /* 0xBF800A20 */
  .extern PR3CLR           /* 0xBF800A24 */
  .extern PR3SET           /* 0xBF800A28 */
  .extern PR3INV           /* 0xBF800A2C */
  .extern T4CON            /* 0xBF800C00 */
  .extern T4CONCLR         /* 0xBF800C04 */
  .extern T4CONSET         /* 0xBF800C08 */
  .extern T4CONINV         /* 0xBF800C0C */
  .extern TMR4             /* 0xBF800C10 */
  .extern TMR45            /* 0xBF800C10 */
  .extern TMR4CLR          /* 0xBF800C14 */
  .extern TMR4SET          /* 0xBF800C18 */
  .extern TMR4INV          /* 0xBF800C1C */
  .extern PR4              /* 0xBF800C20 */
  .extern PR45             /* 0xBF800C20 */
  .extern PR4CLR           /* 0xBF800C24 */
  .extern PR4SET           /* 0xBF800C28 */
  .extern PR4INV           /* 0xBF800C2C */
  .extern T5CON            /* 0xBF800E00 */
  .extern T5CONCLR         /* 0xBF800E04 */
  .extern T5CONSET         /* 0xBF800E08 */
  .extern T5CONINV         /* 0xBF800E0C */
  .extern TMR5             /* 0xBF800E10 */
  .extern TMR5CLR          /* 0xBF800E14 */
  .extern TMR5SET          /* 0xBF800E18 */
  .extern TMR5INV          /* 0xBF800E1C */
  .extern PR5              /* 0xBF800E20 */
  .extern PR5CLR           /* 0xBF800E24 */
  .extern PR5SET           /* 0xBF800E28 */
  .extern PR5INV           /* 0xBF800E2C */
  .extern IC1CON           /* 0xBF802000 */
  .extern IC1CONCLR        /* 0xBF802004 */
  .extern IC1CONSET        /* 0xBF802008 */
  .extern IC1CONINV        /* 0xBF80200C */
  .extern IC1BUF           /* 0xBF802010 */
  .extern IC2CON           /* 0xBF802200 */
  .extern IC2CONCLR        /* 0xBF802204 */
  .extern IC2CONSET        /* 0xBF802208 */
  .extern IC2CONINV        /* 0xBF80220C */
  .extern IC2BUF           /* 0xBF802210 */
  .extern IC3CON           /* 0xBF802400 */
  .extern IC3CONCLR        /* 0xBF802404 */
  .extern IC3CONSET        /* 0xBF802408 */
  .extern IC3CONINV        /* 0xBF80240C */
  .extern IC3BUF           /* 0xBF802410 */
  .extern IC4CON           /* 0xBF802600 */
  .extern IC4CONCLR        /* 0xBF802604 */
  .extern IC4CONSET        /* 0xBF802608 */
  .extern IC4CONINV        /* 0xBF80260C */
  .extern IC4BUF           /* 0xBF802610 */
  .extern IC5CON           /* 0xBF802800 */
  .extern IC5CONCLR        /* 0xBF802804 */
  .extern IC5CONSET        /* 0xBF802808 */
  .extern IC5CONINV        /* 0xBF80280C */
  .extern IC5BUF           /* 0xBF802810 */
  .extern OC1CON           /* 0xBF803000 */
  .extern OC1CONCLR        /* 0xBF803004 */
  .extern OC1CONSET        /* 0xBF803008 */
  .extern OC1CONINV        /* 0xBF80300C */
  .extern OC1R             /* 0xBF803010 */
  .extern OC1RCLR          /* 0xBF803014 */
  .extern OC1RSET          /* 0xBF803018 */
  .extern OC1RINV          /* 0xBF80301C */
  .extern OC1RS            /* 0xBF803020 */
  .extern OC1RSCLR         /* 0xBF803024 */
  .extern OC1RSSET         /* 0xBF803028 */
  .extern OC1RSINV         /* 0xBF80302C */
  .extern OC2CON           /* 0xBF803200 */
  .extern OC2CONCLR        /* 0xBF803204 */
  .extern OC2CONSET        /* 0xBF803208 */
  .extern OC2CONINV        /* 0xBF80320C */
  .extern OC2R             /* 0xBF803210 */
  .extern OC2RCLR          /* 0xBF803214 */
  .extern OC2RSET          /* 0xBF803218 */
  .extern OC2RINV          /* 0xBF80321C */
  .extern OC2RS            /* 0xBF803220 */
  .extern OC2RSCLR         /* 0xBF803224 */
  .extern OC2RSSET         /* 0xBF803228 */
  .extern OC2RSINV         /* 0xBF80322C */
  .extern OC3CON           /* 0xBF803400 */
  .extern OC3CONCLR        /* 0xBF803404 */
  .extern OC3CONSET        /* 0xBF803408 */
  .extern OC3CONINV        /* 0xBF80340C */
  .extern OC3R             /* 0xBF803410 */
  .extern OC3RCLR          /* 0xBF803414 */
  .extern OC3RSET          /* 0xBF803418 */
  .extern OC3RINV          /* 0xBF80341C */
  .extern OC3RS            /* 0xBF803420 */
  .extern OC3RSCLR         /* 0xBF803424 */
  .extern OC3RSSET         /* 0xBF803428 */
  .extern OC3RSINV         /* 0xBF80342C */
  .extern OC4CON           /* 0xBF803600 */
  .extern OC4CONCLR        /* 0xBF803604 */
  .extern OC4CONSET        /* 0xBF803608 */
  .extern OC4CONINV        /* 0xBF80360C */
  .extern OC4R             /* 0xBF803610 */
  .extern OC4RCLR          /* 0xBF803614 */
  .extern OC4RSET          /* 0xBF803618 */
  .extern OC4RINV          /* 0xBF80361C */
  .extern OC4RS            /* 0xBF803620 */
  .extern OC4RSCLR         /* 0xBF803624 */
  .extern OC4RSSET         /* 0xBF803628 */
  .extern OC4RSINV         /* 0xBF80362C */
  .extern OC5CON           /* 0xBF803800 */
  .extern OC5CONCLR        /* 0xBF803804 */
  .extern OC5CONSET        /* 0xBF803808 */
  .extern OC5CONINV        /* 0xBF80380C */
  .extern OC5R             /* 0xBF803810 */
  .extern OC5RCLR          /* 0xBF803814 */
  .extern OC5RSET          /* 0xBF803818 */
  .extern OC5RINV          /* 0xBF80381C */
  .extern OC5RS            /* 0xBF803820 */
  .extern OC5RSCLR         /* 0xBF803824 */
  .extern OC5RSSET         /* 0xBF803828 */
  .extern OC5RSINV         /* 0xBF80382C */
  .extern I2C1ACON         /* 0xBF805000 */
  .extern I2C1ACONCLR      /* 0xBF805004 */
  .extern I2C1ACONSET      /* 0xBF805008 */
  .extern I2C1ACONINV      /* 0xBF80500C */
  .extern I2C1ASTAT        /* 0xBF805010 */
  .extern I2C1ASTATCLR     /* 0xBF805014 */
  .extern I2C1ASTATSET     /* 0xBF805018 */
  .extern I2C1ASTATINV     /* 0xBF80501C */
  .extern I2C1AADD         /* 0xBF805020 */
  .extern I2C1AADDCLR      /* 0xBF805024 */
  .extern I2C1AADDSET      /* 0xBF805028 */
  .extern I2C1AADDINV      /* 0xBF80502C */
  .extern I2C1AMSK         /* 0xBF805030 */
  .extern I2C1AMSKCLR      /* 0xBF805034 */
  .extern I2C1AMSKSET      /* 0xBF805038 */
  .extern I2C1AMSKINV      /* 0xBF80503C */
  .extern I2C1ABRG         /* 0xBF805040 */
  .extern I2C1ABRGCLR      /* 0xBF805044 */
  .extern I2C1ABRGSET      /* 0xBF805048 */
  .extern I2C1ABRGINV      /* 0xBF80504C */
  .extern I2C1ATRN         /* 0xBF805050 */
  .extern I2C1ATRNCLR      /* 0xBF805054 */
  .extern I2C1ATRNSET      /* 0xBF805058 */
  .extern I2C1ATRNINV      /* 0xBF80505C */
  .extern I2C1ARCV         /* 0xBF805060 */
  .extern I2C2ACON         /* 0xBF805100 */
  .extern I2C2ACONCLR      /* 0xBF805104 */
  .extern I2C2ACONSET      /* 0xBF805108 */
  .extern I2C2ACONINV      /* 0xBF80510C */
  .extern I2C2ASTAT        /* 0xBF805110 */
  .extern I2C2ASTATCLR     /* 0xBF805114 */
  .extern I2C2ASTATSET     /* 0xBF805118 */
  .extern I2C2ASTATINV     /* 0xBF80511C */
  .extern I2C2AADD         /* 0xBF805120 */
  .extern I2C2AADDCLR      /* 0xBF805124 */
  .extern I2C2AADDSET      /* 0xBF805128 */
  .extern I2C2AADDINV      /* 0xBF80512C */
  .extern I2C2AMSK         /* 0xBF805130 */
  .extern I2C2AMSKCLR      /* 0xBF805134 */
  .extern I2C2AMSKSET      /* 0xBF805138 */
  .extern I2C2AMSKINV      /* 0xBF80513C */
  .extern I2C2ABRG         /* 0xBF805140 */
  .extern I2C2ABRGCLR      /* 0xBF805144 */
  .extern I2C2ABRGSET      /* 0xBF805148 */
  .extern I2C2ABRGINV      /* 0xBF80514C */
  .extern I2C2ATRN         /* 0xBF805150 */
  .extern I2C2ATRNCLR      /* 0xBF805154 */
  .extern I2C2ATRNSET      /* 0xBF805158 */
  .extern I2C2ATRNINV      /* 0xBF80515C */
  .extern I2C2ARCV         /* 0xBF805160 */
  .extern I2C3ACON         /* 0xBF805200 */
  .extern I2C3ACONCLR      /* 0xBF805204 */
  .extern I2C3ACONSET      /* 0xBF805208 */
  .extern I2C3ACONINV      /* 0xBF80520C */
  .extern I2C3ASTAT        /* 0xBF805210 */
  .extern I2C3ASTATCLR     /* 0xBF805214 */
  .extern I2C3ASTATSET     /* 0xBF805218 */
  .extern I2C3ASTATINV     /* 0xBF80521C */
  .extern I2C3AADD         /* 0xBF805220 */
  .extern I2C3AADDCLR      /* 0xBF805224 */
  .extern I2C3AADDSET      /* 0xBF805228 */
  .extern I2C3AADDINV      /* 0xBF80522C */
  .extern I2C3AMSK         /* 0xBF805230 */
  .extern I2C3AMSKCLR      /* 0xBF805234 */
  .extern I2C3AMSKSET      /* 0xBF805238 */
  .extern I2C3AMSKINV      /* 0xBF80523C */
  .extern I2C3ABRG         /* 0xBF805240 */
  .extern I2C3ABRGCLR      /* 0xBF805244 */
  .extern I2C3ABRGSET      /* 0xBF805248 */
  .extern I2C3ABRGINV      /* 0xBF80524C */
  .extern I2C3ATRN         /* 0xBF805250 */
  .extern I2C3ATRNCLR      /* 0xBF805254 */
  .extern I2C3ATRNSET      /* 0xBF805258 */
  .extern I2C3ATRNINV      /* 0xBF80525C */
  .extern I2C3ARCV         /* 0xBF805260 */
  .extern I2C1CON          /* 0xBF805300 */
  .extern I2C1CONCLR       /* 0xBF805304 */
  .extern I2C1CONSET       /* 0xBF805308 */
  .extern I2C1CONINV       /* 0xBF80530C */
  .extern I2C1STAT         /* 0xBF805310 */
  .extern I2C1STATCLR      /* 0xBF805314 */
  .extern I2C1STATSET      /* 0xBF805318 */
  .extern I2C1STATINV      /* 0xBF80531C */
  .extern I2C1ADD          /* 0xBF805320 */
  .extern I2C1ADDCLR       /* 0xBF805324 */
  .extern I2C1ADDSET       /* 0xBF805328 */
  .extern I2C1ADDINV       /* 0xBF80532C */
  .extern I2C1MSK          /* 0xBF805330 */
  .extern I2C1MSKCLR       /* 0xBF805334 */
  .extern I2C1MSKSET       /* 0xBF805338 */
  .extern I2C1MSKINV       /* 0xBF80533C */
  .extern I2C1BRG          /* 0xBF805340 */
  .extern I2C1BRGCLR       /* 0xBF805344 */
  .extern I2C1BRGSET       /* 0xBF805348 */
  .extern I2C1BRGINV       /* 0xBF80534C */
  .extern I2C1TRN          /* 0xBF805350 */
  .extern I2C1TRNCLR       /* 0xBF805354 */
  .extern I2C1TRNSET       /* 0xBF805358 */
  .extern I2C1TRNINV       /* 0xBF80535C */
  .extern I2C1RCV          /* 0xBF805360 */
  .extern I2C2CON          /* 0xBF805400 */
  .extern I2C2CONCLR       /* 0xBF805404 */
  .extern I2C2CONSET       /* 0xBF805408 */
  .extern I2C2CONINV       /* 0xBF80540C */
  .extern I2C2STAT         /* 0xBF805410 */
  .extern I2C2STATCLR      /* 0xBF805414 */
  .extern I2C2STATSET      /* 0xBF805418 */
  .extern I2C2STATINV      /* 0xBF80541C */
  .extern I2C2ADD          /* 0xBF805420 */
  .extern I2C2ADDCLR       /* 0xBF805424 */
  .extern I2C2ADDSET       /* 0xBF805428 */
  .extern I2C2ADDINV       /* 0xBF80542C */
  .extern I2C2MSK          /* 0xBF805430 */
  .extern I2C2MSKCLR       /* 0xBF805434 */
  .extern I2C2MSKSET       /* 0xBF805438 */
  .extern I2C2MSKINV       /* 0xBF80543C */
  .extern I2C2BRG          /* 0xBF805440 */
  .extern I2C2BRGCLR       /* 0xBF805444 */
  .extern I2C2BRGSET       /* 0xBF805448 */
  .extern I2C2BRGINV       /* 0xBF80544C */
  .extern I2C2TRN          /* 0xBF805450 */
  .extern I2C2TRNCLR       /* 0xBF805454 */
  .extern I2C2TRNSET       /* 0xBF805458 */
  .extern I2C2TRNINV       /* 0xBF80545C */
  .extern I2C2RCV          /* 0xBF805460 */
  .extern SPI1ACON         /* 0xBF805800 */
  .extern SPI1ACONCLR      /* 0xBF805804 */
  .extern SPI1ACONSET      /* 0xBF805808 */
  .extern SPI1ACONINV      /* 0xBF80580C */
  .extern SPI1ASTAT        /* 0xBF805810 */
  .extern SPI1ASTATCLR     /* 0xBF805814 */
  .extern SPI1ASTATSET     /* 0xBF805818 */
  .extern SPI1ASTATINV     /* 0xBF80581C */
  .extern SPI1ABUF         /* 0xBF805820 */
  .extern SPI1ABRG         /* 0xBF805830 */
  .extern SPI1ABRGCLR      /* 0xBF805834 */
  .extern SPI1ABRGSET      /* 0xBF805838 */
  .extern SPI1ABRGINV      /* 0xBF80583C */
  .extern SPI2ACON         /* 0xBF805A00 */
  .extern SPI2CON          /* 0xBF805A00 */
  .extern SPI2ACONCLR      /* 0xBF805A04 */
  .extern SPI2CONCLR       /* 0xBF805A04 */
  .extern SPI2ACONSET      /* 0xBF805A08 */
  .extern SPI2CONSET       /* 0xBF805A08 */
  .extern SPI2ACONINV      /* 0xBF805A0C */
  .extern SPI2CONINV       /* 0xBF805A0C */
  .extern SPI2ASTAT        /* 0xBF805A10 */
  .extern SPI2STAT         /* 0xBF805A10 */
  .extern SPI2ASTATCLR     /* 0xBF805A14 */
  .extern SPI2STATCLR      /* 0xBF805A14 */
  .extern SPI2ASTATSET     /* 0xBF805A18 */
  .extern SPI2STATSET      /* 0xBF805A18 */
  .extern SPI2ASTATINV     /* 0xBF805A1C */
  .extern SPI2STATINV      /* 0xBF805A1C */
  .extern SPI2ABUF         /* 0xBF805A20 */
  .extern SPI2BUF          /* 0xBF805A20 */
  .extern SPI2ABRG         /* 0xBF805A30 */
  .extern SPI2BRG          /* 0xBF805A30 */
  .extern SPI2ABRGCLR      /* 0xBF805A34 */
  .extern SPI2BRGCLR       /* 0xBF805A34 */
  .extern SPI2ABRGSET      /* 0xBF805A38 */
  .extern SPI2BRGSET       /* 0xBF805A38 */
  .extern SPI2ABRGINV      /* 0xBF805A3C */
  .extern SPI2BRGINV       /* 0xBF805A3C */
  .extern SPI3ACON         /* 0xBF805C00 */
  .extern SPI3ACONCLR      /* 0xBF805C04 */
  .extern SPI3ACONSET      /* 0xBF805C08 */
  .extern SPI3ACONINV      /* 0xBF805C0C */
  .extern SPI3ASTAT        /* 0xBF805C10 */
  .extern SPI3ASTATCLR     /* 0xBF805C14 */
  .extern SPI3ASTATSET     /* 0xBF805C18 */
  .extern SPI3ASTATINV     /* 0xBF805C1C */
  .extern SPI3ABUF         /* 0xBF805C20 */
  .extern SPI3ABRG         /* 0xBF805C30 */
  .extern SPI3ABRGCLR      /* 0xBF805C34 */
  .extern SPI3ABRGSET      /* 0xBF805C38 */
  .extern SPI3ABRGINV      /* 0xBF805C3C */
  .extern SPI1CON          /* 0xBF805E00 */
  .extern SPI1CONCLR       /* 0xBF805E04 */
  .extern SPI1CONSET       /* 0xBF805E08 */
  .extern SPI1CONINV       /* 0xBF805E0C */
  .extern SPI1STAT         /* 0xBF805E10 */
  .extern SPI1STATCLR      /* 0xBF805E14 */
  .extern SPI1STATSET      /* 0xBF805E18 */
  .extern SPI1STATINV      /* 0xBF805E1C */
  .extern SPI1BUF          /* 0xBF805E20 */
  .extern SPI1BRG          /* 0xBF805E30 */
  .extern SPI1BRGCLR       /* 0xBF805E34 */
  .extern SPI1BRGSET       /* 0xBF805E38 */
  .extern SPI1BRGINV       /* 0xBF805E3C */
  .extern U1AMODE          /* 0xBF806000 */
  .extern U1MODE           /* 0xBF806000 */
  .extern U1AMODECLR       /* 0xBF806004 */
  .extern U1MODECLR        /* 0xBF806004 */
  .extern U1AMODESET       /* 0xBF806008 */
  .extern U1MODESET        /* 0xBF806008 */
  .extern U1AMODEINV       /* 0xBF80600C */
  .extern U1MODEINV        /* 0xBF80600C */
  .extern U1ASTA           /* 0xBF806010 */
  .extern U1STA            /* 0xBF806010 */
  .extern U1ASTACLR        /* 0xBF806014 */
  .extern U1STACLR         /* 0xBF806014 */
  .extern U1ASTASET        /* 0xBF806018 */
  .extern U1STASET         /* 0xBF806018 */
  .extern U1ASTAINV        /* 0xBF80601C */
  .extern U1STAINV         /* 0xBF80601C */
  .extern U1ATXREG         /* 0xBF806020 */
  .extern U1TXREG          /* 0xBF806020 */
  .extern U1ARXREG         /* 0xBF806030 */
  .extern U1RXREG          /* 0xBF806030 */
  .extern U1ABRG           /* 0xBF806040 */
  .extern U1BRG            /* 0xBF806040 */
  .extern U1ABRGCLR        /* 0xBF806044 */
  .extern U1BRGCLR         /* 0xBF806044 */
  .extern U1ABRGSET        /* 0xBF806048 */
  .extern U1BRGSET         /* 0xBF806048 */
  .extern U1ABRGINV        /* 0xBF80604C */
  .extern U1BRGINV         /* 0xBF80604C */
  .extern U1BMODE          /* 0xBF806200 */
  .extern U1BMODECLR       /* 0xBF806204 */
  .extern U1BMODESET       /* 0xBF806208 */
  .extern U1BMODEINV       /* 0xBF80620C */
  .extern U1BSTA           /* 0xBF806210 */
  .extern U1BSTACLR        /* 0xBF806214 */
  .extern U1BSTASET        /* 0xBF806218 */
  .extern U1BSTAINV        /* 0xBF80621C */
  .extern U1BTXREG         /* 0xBF806220 */
  .extern U1BRXREG         /* 0xBF806230 */
  .extern U1BBRG           /* 0xBF806240 */
  .extern U1BBRGCLR        /* 0xBF806244 */
  .extern U1BBRGSET        /* 0xBF806248 */
  .extern U1BBRGINV        /* 0xBF80624C */
  .extern U2AMODE          /* 0xBF806400 */
  .extern U2AMODECLR       /* 0xBF806404 */
  .extern U2AMODESET       /* 0xBF806408 */
  .extern U2AMODEINV       /* 0xBF80640C */
  .extern U2ASTA           /* 0xBF806410 */
  .extern U2ASTACLR        /* 0xBF806414 */
  .extern U2ASTASET        /* 0xBF806418 */
  .extern U2ASTAINV        /* 0xBF80641C */
  .extern U2ATXREG         /* 0xBF806420 */
  .extern U2ARXREG         /* 0xBF806430 */
  .extern U2ABRG           /* 0xBF806440 */
  .extern U2ABRGCLR        /* 0xBF806444 */
  .extern U2ABRGSET        /* 0xBF806448 */
  .extern U2ABRGINV        /* 0xBF80644C */
  .extern U2BMODE          /* 0xBF806600 */
  .extern U2BMODECLR       /* 0xBF806604 */
  .extern U2BMODESET       /* 0xBF806608 */
  .extern U2BMODEINV       /* 0xBF80660C */
  .extern U2BSTA           /* 0xBF806610 */
  .extern U2BSTACLR        /* 0xBF806614 */
  .extern U2BSTASET        /* 0xBF806618 */
  .extern U2BSTAINV        /* 0xBF80661C */
  .extern U2BTXREG         /* 0xBF806620 */
  .extern U2BRXREG         /* 0xBF806630 */
  .extern U2BBRG           /* 0xBF806640 */
  .extern U2BBRGCLR        /* 0xBF806644 */
  .extern U2BBRGSET        /* 0xBF806648 */
  .extern U2BBRGINV        /* 0xBF80664C */
  .extern U2MODE           /* 0xBF806800 */
  .extern U3AMODE          /* 0xBF806800 */
  .extern U2MODECLR        /* 0xBF806804 */
  .extern U3AMODECLR       /* 0xBF806804 */
  .extern U2MODESET        /* 0xBF806808 */
  .extern U3AMODESET       /* 0xBF806808 */
  .extern U2MODEINV        /* 0xBF80680C */
  .extern U3AMODEINV       /* 0xBF80680C */
  .extern U2STA            /* 0xBF806810 */
  .extern U3ASTA           /* 0xBF806810 */
  .extern U2STACLR         /* 0xBF806814 */
  .extern U3ASTACLR        /* 0xBF806814 */
  .extern U2STASET         /* 0xBF806818 */
  .extern U3ASTASET        /* 0xBF806818 */
  .extern U2STAINV         /* 0xBF80681C */
  .extern U3ASTAINV        /* 0xBF80681C */
  .extern U2TXREG          /* 0xBF806820 */
  .extern U3ATXREG         /* 0xBF806820 */
  .extern U2RXREG          /* 0xBF806830 */
  .extern U3ARXREG         /* 0xBF806830 */
  .extern U2BRG            /* 0xBF806840 */
  .extern U3ABRG           /* 0xBF806840 */
  .extern U2BRGCLR         /* 0xBF806844 */
  .extern U3ABRGCLR        /* 0xBF806844 */
  .extern U2BRGSET         /* 0xBF806848 */
  .extern U3ABRGSET        /* 0xBF806848 */
  .extern U2BRGINV         /* 0xBF80684C */
  .extern U3ABRGINV        /* 0xBF80684C */
  .extern U3BMODE          /* 0xBF806A00 */
  .extern U3BMODECLR       /* 0xBF806A04 */
  .extern U3BMODESET       /* 0xBF806A08 */
  .extern U3BMODEINV       /* 0xBF806A0C */
  .extern U3BSTA           /* 0xBF806A10 */
  .extern U3BSTACLR        /* 0xBF806A14 */
  .extern U3BSTASET        /* 0xBF806A18 */
  .extern U3BSTAINV        /* 0xBF806A1C */
  .extern U3BTXREG         /* 0xBF806A20 */
  .extern U3BRXREG         /* 0xBF806A30 */
  .extern U3BBRG           /* 0xBF806A40 */
  .extern U3BBRGCLR        /* 0xBF806A44 */
  .extern U3BBRGSET        /* 0xBF806A48 */
  .extern U3BBRGINV        /* 0xBF806A4C */
  .extern PMCON            /* 0xBF807000 */
  .extern PMCONCLR         /* 0xBF807004 */
  .extern PMCONSET         /* 0xBF807008 */
  .extern PMCONINV         /* 0xBF80700C */
  .extern PMMODE           /* 0xBF807010 */
  .extern PMMODECLR        /* 0xBF807014 */
  .extern PMMODESET        /* 0xBF807018 */
  .extern PMMODEINV        /* 0xBF80701C */
  .extern PMADDR           /* 0xBF807020 */
  .extern PMADDRCLR        /* 0xBF807024 */
  .extern PMADDRSET        /* 0xBF807028 */
  .extern PMADDRINV        /* 0xBF80702C */
  .extern PMDOUT           /* 0xBF807030 */
  .extern PMDOUTCLR        /* 0xBF807034 */
  .extern PMDOUTSET        /* 0xBF807038 */
  .extern PMDOUTINV        /* 0xBF80703C */
  .extern PMDIN            /* 0xBF807040 */
  .extern PMDINCLR         /* 0xBF807044 */
  .extern PMDINSET         /* 0xBF807048 */
  .extern PMDININV         /* 0xBF80704C */
  .extern PMAEN            /* 0xBF807050 */
  .extern PMAENCLR         /* 0xBF807054 */
  .extern PMAENSET         /* 0xBF807058 */
  .extern PMAENINV         /* 0xBF80705C */
  .extern PMSTAT           /* 0xBF807060 */
  .extern PMSTATCLR        /* 0xBF807064 */
  .extern PMSTATSET        /* 0xBF807068 */
  .extern PMSTATINV        /* 0xBF80706C */
  .extern AD1CON1          /* 0xBF809000 */
  .extern AD1CON1CLR       /* 0xBF809004 */
  .extern AD1CON1SET       /* 0xBF809008 */
